
./octez-client --wait none originate smart rollup rollup from bootstrap1 of kind arith of type bytes with kernel  --burn-cap 9999999
Node is bootstrapped.
Estimated gas: 1930.030 units (will add 100 for safety)
Estimated storage: 6552 bytes added (will add 20 for safety)
Operation successfully injected in the node.
Operation hash is '[OPERATION_HASH]'
NOT waiting for the operation to be included.
Use command
  octez-client wait for [OPERATION_HASH] to be included --confirmations 1 --branch [BLOCK_HASH]
and/or an external block explorer to make sure that it has been included.
This sequence of operations was run:
  Manager signed operations:
    From: [PUBLIC_KEY_HASH]
    Fee to the baker: ꜩ0.000441
    Expected counter: 1
    Gas limit: 2031
    Storage limit: 6572 bytes
    Balance updates:
      [PUBLIC_KEY_HASH] ... -ꜩ0.000441
      payload fees(the block proposer) ....... +ꜩ0.000441
    Smart rollup origination:
      Kind: arith
      Parameter type: bytes
      Kernel Blake2B hash: '0e5751c026e543b2e8ab2eb06099daa1d1e5df47778f7787faab45cdf12fe3a8'
      This smart rollup origination was successfully applied
      Consumed gas: 1929.997
      Storage size: 6552 bytes
      Address: [SMART_ROLLUP_HASH]
      Genesis commitment hash: [SC_ROLLUP_COMMITMENT_HASH]
      Balance updates:
        [PUBLIC_KEY_HASH] ... -ꜩ1.638
        storage fees ........................... +ꜩ1.638

Smart rollup [SMART_ROLLUP_HASH] memorized as "rollup"

./octez-client rpc get '/chains/main/blocks/head/context/smart_rollups/smart_rollup/[SMART_ROLLUP_HASH]/genesis_info'
{ "level": 2,
  "commitment_hash": "[SC_ROLLUP_COMMITMENT_HASH]" }
GET http://127.0.0.1:[PORT]/global/block/head/state?key=vars/value
200 OK
"00000007"

GET http://127.0.0.1:[PORT]/global/block/head/state?key=vars/value
200 OK
"0000000a"

GET http://127.0.0.1:[PORT]/global/block/head/state?key=vars/value
200 OK
"0000000d"

GET http://127.0.0.1:[PORT]/global/block/head/state?key=vars/value
200 OK
"00000010"

GET http://127.0.0.1:[PORT]/global/block/head/state?key=vars/value
200 OK
"00000013"

GET http://127.0.0.1:[PORT]/global/block/head/state?key=vars/value
200 OK
"00000016"

GET http://127.0.0.1:[PORT]/global/block/head/state?key=vars/value
200 OK
"00000019"

GET http://127.0.0.1:[PORT]/global/block/head/state?key=vars/value
200 OK
"0000001c"

GET http://127.0.0.1:[PORT]/global/block/head/state?key=vars/value
200 OK
"0000001f"

GET http://127.0.0.1:[PORT]/global/block/head/state?key=vars/value
200 OK
"00000022"

